//-----------------------------------------------------------------------------
// File: packcage.h
//-----------------------------------------------------------------------------
#ifndef PACKCAGE_H
#define PACKCAGE_H
//-----------------------------------------------------------------------------
#include <iostream>
#include <ctime>
//-----------------------------------------------------------------------------
void Randomize();             // Первичная установка зерна генератора
int iRandom(int a, int b);    // Создать случайное целое число из [a, b]
double dRandom(int a, int b); // Создать случайное дробное число из [a, b]
//----------------------------------------------------------------------------
void InputData(int &size, int &dif);         // Ввод первичных данных
void GenerateArr(int *m, int s, int dif);    // Генерация массива данных (int)
void GenerateArr(double *m, int s, int dif); // Генерация массива данных
void PrintArr(int *a, int size);    // Печать массива данных (int)
void PrintArr(double *a, int size); // Печать массива данных
//-----------------------------------------------------------------------------
#endif /* PACKCAGE_H */
//-----------------------------------------------------------------------------